# Analyse Data with SQL: Warby Parker Funnel Analysis

Warby Parker is a transformative lifestyle brand with a lofty objective: to offer designer eyewear at a revolutionary price while leading the way for socially conscious businesses. 

Founded in 2010 and named after two characters in an early Jack Kerouac journal, Warby Parker believes in creative thinking, smart design, and doing good in the world. For every pair of eyeglasses and sunglasses sold, a pair is distributed to someone in need.

The funnels and tables given in this exercise are:

**Quiz Funnel tables:** `survey`

**Home Try-On Funnel tables:** `quiz`, `home_try_on`, `purchase`

## 1. Quiz Funnel Analysis

### 1.1 What does the `survey` table have?

To help users find their perfect frame, Warby Parker has a Style Quiz that has the following questions:

1. “What are you looking for?”
2. “What’s your fit?”
3. “Which shapes do you like?”
4. “Which colors do you like?”
5. “When was your last eye exam?”

Responses are stored in a table called `survey`.

In [1]:
import pandas as pd
from sqlalchemy import create_engine
engine = create_engine("postgresql+psycopg2://funnels:funnels@localhost:5432/funnels")

In [2]:
query = "SELECT * FROM survey LIMIT 10"
df_1_1 = pd.read_sql_query(query, engine)
df_1_1.head(50)

,question,user_id,response
0,1. What are you looking for?,005e7f99-d48c-4fce-b605-10506c85aaf7,Women's Styles
1,2. What's your fit?,005e7f99-d48c-4fce-b605-10506c85aaf7,Medium
2,3. Which shapes do you like?,00a556ed-f13e-4c67-8704-27e3573684cd,Round
3,4. Which colors do you like?,00a556ed-f13e-4c67-8704-27e3573684cd,Two-Tone
4,1. What are you looking for?,00a556ed-f13e-4c67-8704-27e3573684cd,I'm not sure. Let's skip it.
5,2. What's your fit?,00a556ed-f13e-4c67-8704-27e3573684cd,Narrow
6,5. When was your last eye exam?,00a556ed-f13e-4c67-8704-27e3573684cd,<1 Year
7,3. Which shapes do you like?,00bf9d63-0999-43a3-9e5b-9c372e6890d2,Square
8,5. When was your last eye exam?,00bf9d63-0999-43a3-9e5b-9c372e6890d2,<1 Year
9,2. What's your fit?,00bf9d63-0999-43a3-9e5b-9c372e6890d2,Medium

### 1.2 What is the number of responses for each question?

Users will “give up” at different points in the survey. 

The table below shows the number of users that respond to each question (num_response). This tells us that out of 500 users who took the quiz, 270 of them answered all 5 questions.

In [3]:
query = "SELECT question, COUNT(DISTINCT user_id) AS num_response FROM survey GROUP BY question ORDER BY question"
df_1_2 = pd.read_sql_query(query, engine)
df_1_2.head(50)

                          question  num_response
0     1. What are you looking for?           500
1              2. What's your fit?           475
2     3. Which shapes do you like?           380
3     4. Which colors do you like?           361
4  5. When was your last eye exam?           270

### 1.3 Which question(s) of the quiz have a lower completion rates?

We see below that questions 2 and 4 have high completion rates (response_rate), but questions 3 and 5 have lower rates. This suggests that people might be more reluctant to answer uncommon opinion questions and some do not remember when they had their last eye exam.

In [4]:
df_1_2['response_percent'] = ['100%','95%','80%','95%','75%']
df_1_2.head(50)

                          question  num_response response_percent
0     1. What are you looking for?           500             100%
1              2. What's your fit?           475              95%
2     3. Which shapes do you like?           380              80%
3     4. Which colors do you like?           361              95%
4  5. When was your last eye exam?           270              75%

## 2. Home Try-On Funnel Analysis

### 2.1 What do the `quiz`, `home_try_on` and `purchase` tables have?

As seen below, the `quiz` table contains the answers selected by each user who completed the Style Quiz. 

During the Home Try-On stage, we will be conducting an A/B Test:
 - 50% of the users will get 3 pairs to try on
 - 50% of the users will get 5 pairs to try on

This information and user addresses are provided in the `home_try_on` table.  

The `purchase` table contains the style, model, color and price of products that each user purchased.

In [5]:
query = "SELECT * FROM quiz LIMIT 5"
df_2_1_1 = pd.read_sql_query(query, engine)
df_2_1_1.head(50)

,user_id,style,fit,shape,color
0,4e8118dc-bb3d-49bf-85fc-cca8d83232ac,Women's Styles,Medium,Rectangular,Tortoise
1,291f1cca-e507-48be-b063-002b14906468,Women's Styles,Narrow,Round,Black
2,75122300-0736-4087-b6d8-c0c5373a1a04,Women's Styles,Wide,Rectangular,Two-Tone
3,75bc6ebd-40cd-4e1d-a301-27ddd93b12e2,Women's Styles,Narrow,Square,Two-Tone
4,ce965c4d-7a2b-4db6-9847-601747fa7812,Women's Styles,Wide,Rectangular,Black

In [6]:
query = "SELECT * FROM home_try_on LIMIT 5"
df_2_1_2 = pd.read_sql_query(query, engine)
df_2_1_2.head(50)

                                user_id number_of_pairs               address
0  d8addd87-3217-4429-9a01-d56d68111da7         5 pairs       145 New York 9a
1  f52b07c8-abe4-4f4a-9d39-ba9fc9a184cc         5 pairs       383 Madison Ave
2  8ba0d2d5-1a31-403e-9fa5-79540f8477f9         5 pairs           287 Pell St
3  4e71850e-8bbf-4e6b-accc-49a7bb46c586         3 pairs  347 Madison Square N
4  3bc8f97f-2336-4dab-bd86-e391609dab97         5 pairs       182 Cornelia St

In [7]:
query = "SELECT * FROM purchase LIMIT 5"
df_2_1_3 = pd.read_sql_query(query, engine)
df_2_1_3.head(50)

,user_id,product_id,style,model_name,color,price
0,00a9dd17-36c8-430c-9d76-df49d4197dcf,8,Women's Styles,Lucy,Jet Black,150
1,00e15fe0-c86f-4818-9c63-3422211baa97,7,Women's Styles,Lucy,Elderflower Crystal,150
2,017506f7-aba1-4b9d-8b7b-f4426e71b8ca,4,Men's Styles,Dawes,Jet Black,150
3,0176bfb3-9c51-4b1c-b593-87edab3c54cb,10,Women's Styles,Eugene Narrow,Rosewood Tortoise,95
4,01fdf106-f73c-4d3f-a036-2f3e2ab1ce06,8,Women's Styles,Lucy,Jet Black,150

### 2.2 Building a funnel from multiple tables

To build a funnel by combining the information from the three tables, each row will represent a single user who completed the Style Quiz. 

If the user has any entries in the home_try_on table, then is_home_try_on will be True (represented by 1). If the user has any entries in the purchase table then is_purchase will be True (represented by 1).

In [8]:
query = "SELECT DISTINCT q.user_id, \
h.user_id IS NOT NULL AS is_home_try_on, \
h.number_of_pairs AS number_of_pairs, \
p.user_id IS NOT NULL AS is_purchase \
FROM quiz AS q LEFT JOIN home_try_on AS h ON q.user_id = h.user_id \
LEFT JOIN purchase AS p ON q.user_id = p.user_id LIMIT 10"
df_2_2 = pd.read_sql_query(query, engine)
df_2_2.head(50)

,user_id,is_home_try_on,number_of_pairs,is_purchase
0,bbb02cf2-1dfd-4c72-9292-837dba555414,True,5 pairs,False
1,655b9f0c-64b4-4d04-8b81-4a5223ace1d2,True,5 pairs,False
2,af7afcf3-5bfd-4512-80c1-285cd8a23cef,True,3 pairs,False
3,6d6e0935-457d-4ca5-be23-9deb5a39df44,True,3 pairs,True
4,5a3ee321-517d-4a21-a351-d6815ab2edd5,True,5 pairs,True
5,858b658f-5121-45a1-92d4-1a17b3ab3797,False,None,False
6,24ffbce6-5652-4c41-9dab-8b3d4555b8be,True,5 pairs,True
7,b5e4525f-a92e-4b8b-a63c-fa71279621e5,True,3 pairs,True
8,d004787c-07e8-4e4b-a3b0-470e466a1a82,False,None,False
9,0bd5ab3d-a4c9-4cdb-a2ef-ef3d2c5e2db0,True,5 pairs,True

## 3. Other actionable insights

### 3.1 Overall conversion rate

We can query from the funnels table and calculate overall conversion rates (quiz_to_purchase).

The results below tell us that about 50% of users who complete the quiz (num_quiz) make purchases (num_purchase).

In [9]:
query = "WITH funnels AS (SELECT DISTINCT q.user_id, \
h.user_id IS NOT NULL AS is_home_try_on, \
h.number_of_pairs AS number_of_pairs, \
p.user_id IS NOT NULL AS is_purchase \
FROM quiz AS q LEFT JOIN home_try_on AS h ON q.user_id = h.user_id \
LEFT JOIN purchase AS p ON q.user_id = p.user_id) \
SELECT COUNT(user_id) AS num_quiz, SUM(is_purchase::int) AS num_purchase, \
1.0 * SUM(is_purchase::int)/COUNT(user_id) AS quiz_to_purchase \
FROM funnels"
df_3_1 = pd.read_sql_query(query, engine)
df_3_1.head(50)

   num_quiz  num_purchase  quiz_to_purchase
0      1000           495             0.495

### 3.2 Comparing conversion rates between stages

We can query from the funnels table and calculate overall conversion rates from `quiz` to `home_try_on` and `home_try_on` to `purchase`.

Our calculations below tell us that about 75% of users who complete the Style Quiz move to the Home Try-On stage (quiz_to_home_try_on), and 66% of users who complete the Home Try-On stage make purchases (home_try_on_to_purchase).

In [10]:
query = "WITH funnels AS (SELECT DISTINCT q.user_id, \
h.user_id IS NOT NULL AS is_home_try_on, \
h.number_of_pairs AS number_of_pairs, \
p.user_id IS NOT NULL AS is_purchase \
FROM quiz AS q LEFT JOIN home_try_on AS h ON q.user_id = h.user_id \
LEFT JOIN purchase AS p ON q.user_id = p.user_id) \
SELECT COUNT(user_id) AS num_quiz, SUM(is_home_try_on::int) AS num_home_try_on, \
SUM(is_purchase::int) AS num_purchase, \
1.0 * SUM(is_home_try_on::int)/COUNT(user_id) AS quiz_to_home_try_on, \
1.0 * SUM(is_purchase::int)/SUM(is_home_try_on::int) AS home_try_on_to_purchase \
FROM funnels"
df_3_2 = pd.read_sql_query(query, engine)
df_3_2.head(50)

,num_quiz,num_home_try_on,num_purchase,quiz_to_home_try_on,home_try_on_to_purchase
0,1000,750,495,0.75,0.66

### 3.3 Comparing funnels for A/B tests

We can calculate the difference in purchase rates between customers who had 3 number_of_pairs with ones who had 5.

As seen below, the purchase rate for the customers who had 3 number_of_pairs was 53% while for the customers who had 5 was 79%. This tells us that more customers are likely to make purchases if they receive 5 pairs during the Home Try-On stage.

In [11]:
query = "WITH funnels AS (SELECT DISTINCT q.user_id, \
h.user_id IS NOT NULL AS is_home_try_on, \
h.number_of_pairs AS number_of_pairs, \
p.user_id IS NOT NULL AS is_purchase \
FROM quiz AS q LEFT JOIN home_try_on AS h ON q.user_id = h.user_id \
LEFT JOIN purchase AS p ON q.user_id = p.user_id) \
SELECT SUM(is_home_try_on::int) AS num_home_try_on, number_of_pairs, \
SUM(is_purchase::int) AS num_purchase, \
CASE WHEN SUM(is_home_try_on::int) = 0 THEN 0 \
ELSE 1.0 * SUM(is_purchase::int) / SUM(is_home_try_on::int) \
END AS purchase_rate \
FROM funnels \
GROUP BY number_of_pairs"
df_3_3 = pd.read_sql_query(query, engine)
df_3_3.head(50)

   num_home_try_on number_of_pairs  num_purchase  purchase_rate
0                0            None             0       0.000000
1              379         3 pairs           201       0.530343
2              371         5 pairs           294       0.792453

### 3.4 Most common results of the style quiz

We can calculate the most common results for each question in the Style Quiz. 

As seen below, the highest selected option for each question are:
1. What are you looking for? -> Men’s Styles
2. What’s your fit? -> Narrow
3. Which shapes do you like? -> Rectangular
4. Which colors do you like? -> Tortoise
5. When was your last eye exam? <1 Year

This gives insight into consumer preferences, which can help with shaping effective marketing strategies and hone product offering.

In [12]:
query = "SELECT question, response, COUNT(response) AS num_response FROM survey \
GROUP BY response, question ORDER BY question, num_response"
df_3_4 = pd.read_sql_query(query, engine)
df_3_4.head(50)

,question,response,num_response
0,1. What are you looking for?,I'm not sure. Let's skip it.,49
1,1. What are you looking for?,Women's Styles,209
2,1. What are you looking for?,Men's Styles,242
3,2. What's your fit?,I'm not sure. Let's skip it.,47
4,2. What's your fit?,Wide,88
5,2. What's your fit?,Medium,132
6,2. What's your fit?,Narrow,208
7,3. Which shapes do you like?,No Preference,29
8,3. Which shapes do you like?,Round,91
9,3. Which shapes do you like?,Square,119
10,3. Which shapes do you like?,Rectangular,141
11,4. Which colors do you like?,Two-Tone,27
12,4. Which colors do you like?,Neutral,36
13,4. Which colors do you like?,Crystal,69
14,4. Which colors do you like?,Black,112
15,4. Which colors do you like?,Tortoise,117
16,5. When was your last eye exam?,Not Sure. Let's Skip It,36
17,5. When was your last eye exam?,3+ Years,37
18,5. When was your last eye exam?,1-3 Years,56
19,5. When was your last eye exam?,<1 Year,141

### 3.5 Most common style of sunglasses purchased

We can calculate which style of sunglasses are more commonly purchased. 

From our results below we can see that more customers purchased sunglasses for women in comparison to sunglasses for men. This contrasts the most common choice for the first question in the Style Quiz (1. What are you looking for?’) which was ‘Men’s Styles’, suggesting that some customers who are initially interested in men’s sunglasses do not end up making purchases.

In [13]:
query = "SELECT style, COUNT(*) AS num_purchases FROM purchase GROUP BY style"
df_3_5 = pd.read_sql_query(query, engine)
df_3_5.head(50)

            style  num_purchases
0    Men's Styles            243
1  Women's Styles            252

### 3.6 Most common sunglasses models purchased for each style

We can calculate most popular sunglasses model for Men’s Styles and Women’s Styles based on the number of purchases (num_purchase). 

Our results below tell us that Dawes was the most popular model for sunglasses for men, whilst Eugene Narrow was the most popular model for sunglasses for women.

In [14]:
query = "SELECT style, model_name, COUNT(*) AS num_purchase FROM purchase \
WHERE style = 'Men''s Styles' OR style = 'Women''s Styles' \
GROUP BY model_name, style ORDER BY style, num_purchase"
df_3_6 = pd.read_sql_query(query, engine)
df_3_6.head(50)

            style     model_name  num_purchase
0    Men's Styles        Monocle            41
1    Men's Styles          Brady            95
2    Men's Styles          Dawes           107
3  Women's Styles          Olive            50
4  Women's Styles           Lucy            86
5  Women's Styles  Eugene Narrow           116

### 3.7 Most common sunglasses colors purchased for each style

We can calculate the most popular color choices based on the number of purchases (num_purchase). 

From our calculations we can see that the most popular color for Men Style’s was Driftwood Fade (63 purchases). The most popular color for Women’s Styles was Rosewood Tortoise (62 purchases). 

The highest selected option for the question ‘4. Which colors do you like?’ in the Style Quiz was Tortoise, suggesting that the quiz can be useful for predicting the colors of sunglasses that the users end up purchasing.

In [15]:
query = "SELECT style, color, COUNT(*) AS num_purchase FROM purchase \
WHERE style = 'Men''s Styles' OR style = 'Women''s Styles' \
GROUP BY color, style ORDER BY style, num_purchase"
df_3_7 = pd.read_sql_query(query, engine)
df_3_7.head(50)

            style                   color  num_purchase
0    Men's Styles     Endangered Tortoise            41
1    Men's Styles          Sea Glass Gray            43
2    Men's Styles               Jet Black            44
3    Men's Styles  Layered Tortoise Matte            52
4    Men's Styles          Driftwood Fade            63
5  Women's Styles               Jet Black            42
6  Women's Styles     Elderflower Crystal            44
7  Women's Styles        Pearled Tortoise            50
8  Women's Styles            Rose Crystal            54
9  Women's Styles       Rosewood Tortoise            62